{
  "raw_text": "PLEASE APPLY WITH COVER LETTER\nMachine Learning Engineer \nsuper.AI · Berlin, Berlin, Germany (On-site)\nYour AI-powered job assessment\n\nYou'd be a top applicant, based on your skills, experience, and chances of hearing back\n\n\nOur mission\n\nImagine yourself building the next breakthrough AI/Machine-Learning technology, enabling \"AI for everyone\" at the start of the company's explosive growth. \n\nSuper.AI is used by global enterprises across all industries, from banks, logistics, and insurance companies to Testing, Inspection, and certification (TIC) or retail companies. Super.AI has created the world’s most advanced AI automation platform to extract data from any document with guaranteed quality. We enable companies to leverage the latest AI models, including. LLMs, and super.AI Data Processing Crowd for human-in-the-loop (HITL) review to automate business processes end-to-end with guaranteed results.\n\nYour profile\n\nWhat You'll Do\n\n    Measure and ensure the high-quality output of AI workloads for our enterprise customers.\n    Deploy and manage production workloads for a global customer base.\n    Write, rewrite, and extend Python code, and deploy it to containers (e.g., Docker).\n    Conduct local testing using tools like Jupyter Notebook.\n    Integrate AI cloud solutions and adapt them to our large-scale use cases.\n    Perform prompt engineering for customer use cases.\n    Fine-tune and deploy Large Language Models (LLMs).\n    Develop software that scales to meet the demands of high-load customer workloads.\n\nWhat We Are Looking For\n\n    Smart, humble, hardworking, and collaborative\n        By smart we don't necessarily mean high IQ (although a huge plus), but an affinity toward learning. We want to automate as much as possible so we can focus on the few things that require human intelligence and creativity.\n        By humble we don't mean submissive or unambitious, we mean it in the same way Roger Federer is humble.\n        By hardworking, we don't mean long hours (be with your family). What we mean is while you're here you're doing the best work of your life. It means being disciplined, professional, focused, gritty, resilient, and resourceful.\n        By collaborative, we don't mean submissive or deferential, it means taking leadership from everywhere. \"I'm taking responsibility to fix this system\", if there's a lack of trust \"I'm going to address it\" if goals are unclear \"I'm going to deal with it\", it's about being a meritocracy\n        All four of the above are required. We all know people missing one of these and it's not nice to work with them (e.g. someone who is smart and hardworking but not humble and collaborative).\n    Paradoxical\n        The people we like the most are smart but humble\n        Wants to win no matter what, but will not cross lines of integrity to get there\n        Strong beliefs weakly held, etc.\n\nYour Experience\n\n    3-5 years of professional experience in software development.\n    Proven ability to work backwards from customer needs to deliver AI-based features that meet those needs.\n    Ability to organize and prioritize competing workloads.\n    Familiarity with distributed systems and cloud services (e.g., AWS, Azure, GCP).\n    Solid understanding of machine learning principles.\n    Experience with container frameworks such as Docker or Kubernetes.\n    Proficiency in using REST APIs.\n\nIf this resonates with you, it would be amazing to get to know each other.\n\nWhy us?\n\nAt super.AI our mission is to make AI accessible to all and use AI to enrich the human experience and make the world a better place. We are a group of smart, creative people who have come together from MIT, Microsoft Research, AWS, Google, and Apple to work toward that mission. As a first step towards that goal, we have built an AI platform to help businesses make sense of unstructured data. Our culture is collaborative and fun that puts customers first.\n\nAbout Us\n\n    We believe AI is going to be the most impactful technology ever invented. It may be the last technology we ever needed to invent as humans. We don’t want it to be in the hands of the few, but the hands of the many. Our technology promises to transform the way AI is created and consumed to make this vision possible. \n    We are searching for the best-of-the-best to build a massive company, but at the same time a company where people are happy with their lives, feel healthy, passionate and satisfied. \n    We're at an inflection point, so you will have the opportunity to shape things and see the company grow\n    Although super.AI is young, this is not our first rodeo: our CEO previously founded a few hundred person company, and between us we've held senior positions at Google, Amazon, Adobe, Microsoft, Docusign and others\n\nSee how you compare to others who clicked apply\nCandidates who clicked apply\n\n    559 total 6 in the past day \n\nCandidate seniority level\n\n    59% Entry level candidates\n\n    26% Senior level candidates\n\n    1% Manager level candidates\n\nCandidate education level\n\n    35% have a Master's Degree 32% have a Master of Science 8% have a Bachelor's Degree 25% have other degrees \n\nExclusive Job Seeker Insights about super.AI\nThe latest hiring trend\n\n    41\n\n    Total employees\n\n    7%\n\n    Company-wide\n\n    2 year growth\n    7% decrease\n\nChart\nChart with 25 data points.\nThe chart has 1 X axis displaying Time. Range: 2022-10-24 18:48:00 to 2025-07-07 15:12:00.\nThe chart has 1 Y axis displaying values. Range: 0 to 60.\nEnd of interactive chart.\nMedian employee tenure ‧ \n4 years\nsuper.AI hires candidates from some of these companies and schools\n\n    super.AI hired 1 person from Technische Universität Berlin. See all \n\nShow more Premium insights\nAbout the company\nsuper.AI company logo\nsuper.AI\n4,783 followers\nSoftware Development 11-50 employees 41 on LinkedIn\n\nAutomate business processes end-to-end with guaranteed results using super.AI Intelligent Document Processing (IDP).\nShow more\n\n",
  "language": "english",
  "source": "",
  "company_name": "",
  "title": "",
  "post_date": "",
  "keywords": []
}