{
  "raw_text": "[This ad was originally in de. Translated by Gemini.]\n\nPhysicist/Mathematician/Natural Scientist as Consultant in Data Integration (m/f/d)\nStrong CV Match! More info\n\nSenacor Technologies AG\nBerlin, Bonn, Frankfurt, Hamburg, Munich, Nuremberg, Vienna\nPermanent Position\nFull-time\nPosted: 1 week ago\n\n    €40,400 - €71,300/year (estimated for full-time)\n\nSenacor Technologies AG logo\nPhysicist/Mathematician/Natural Scientist as Consultant in Data Integration (m/f/d)\nSenacor Technologies AG\nslide number 1\nslide number 2\nAbout Senacor\n\nAs an agile IT consultancy, we shape the IT transformation, digitalization, and individual software development of tomorrow with more than 1000 employees. Our focus is on the automotive and banking industries, but numerous other industrial and insurance companies are also among our clients.\n\nThe 4-3-1 principle was yesterday. Just like up or out. Individual coaching at eye level, flexible working hours, and team spirit. That's what we value.\n\nWe have offices in Berlin, Bonn, Frankfurt, Hamburg, Munich, Nuremberg, Vienna, and Zurich. Due to our hybrid working models, you can also work from anywhere else in the DACH region.\nYour Tasks\n\nAs a consultant (m/f/d) in the area of data integration, you will work on large-scale projects in interdisciplinary teams of consultants and developers. Together, you will develop an integration solution that occupies a central place in the client's IT architecture. You will master the daily challenges of project life with your colleagues and experience the motivating dynamics of our delivery culture. You will typically work on these topics:\n\n    At the interface between the business department and IT, you analyze the client's requirements, design solutions, and implement them together with your team\n    You quickly acquire a deep professional understanding of the data to be integrated, model entities and relationships, and further develop the harmonized data model of the integration solution\n    You package deliverables in release management, drive implementation in project management, and ensure in test management that the software receives the final polish for go-live\n\nYour Profile\n\n    Very good university degree in mathematics, physics, natural sciences, or (business) informatics\n    Curiosity and interest in working with large amounts of data and complex models\n    Above-average abstraction ability, analytical thinking, and team spirit\n\nYour Benefits\n\n    Work how and where you want. Flexible working hours, home office, sabbatical, and up to 20 days of workation in the EU\n    Home stays home. Start client trips from your home in Germany, Austria, and Switzerland – without relocating to a Senacor location, but with a higher expense allowance and an all-round carefree package\n    Compensation that convinces. Attractive salary with benefits such as company car, JobRad, subsidy for the Deutschlandticket and childcare, company pension scheme, and 30 days of vacation\n    Career that develops individually. Rapid assumption of responsibility, individual coaching, further training, and programs such as the Female Talents Program\n    An office to feel good in. Modern offices with weekly breakfast, feel-goods, free drinks, game consoles, literature, and an open door for dogs and children\n    Experience more together. Various events, after-work offers, initiatives, communities, and networking formats\n    Additional offers make life more beautiful. Corporate benefits, courses for your work-life balance with voiio, and state-of-the-art IT equipment – also for private use\n\nFurther Information\n\nDoes this profile suit you? Then send us your application documents securely and easily via our web form!\n\nYour Contact Person\n\nLena Rokahr",
  "source": "",
  "company_name": "Senacor Technologies AG",
  "title": "Physicist/Mathematician/Natural Scientist as Consultant in Data Integration (m/f/d)",
  "post_date": "Unknown",
  "keywords": [
    "Data Integration",
    "Consultant",
    "Mathematics",
    "Physics",
    "Natural Sciences",
    "IT Transformation",
    "Digitalization",
    "Software Development",
    "Agile IT Consultancy",
    "Data Analysis"
  ]
}