{
  "raw_text": "Job Description\n\nAbout Consumer Analytics at Wolt\n\nAs the name Consumer Analytics implies, this team aims to provide reliable data insights that drive informed decision-making, empower Wolt's product organization, and foster a data-driven culture through collaboration and education, ultimately inspiring teams and building value for the Consumer group.\n\nAbout The Payments Domain\n\nPayment Group at Wolt is building a world-class payment infrastructure for the best customer experience. You’ll be part of the team working on a smooth, scalable, and secure checkout experience adapting to the many use cases of consumers.\n\nAbout The Role\n\nAs a Data Scientist at Wolt, your role involves diving into our data to solve crucial business problems. The scope of this role ranges from diagnosing problem areas to identifying solutions to designing experiments and ultimately influencing decision-making. This is a rare, operational, and actionable data-driven experience. When you join this team, you will be driving action from the frontlines, rather than just doing yet another analytics role.\n\nIf you enjoy finding patterns amidst chaos, are excited to build from 0 to 1, and have experience using analytics to affect Payments, we're looking for someone like you!\n\nOur offering to you\n\nThe online delivery platform that Wolt is building will offer you interesting and complex challenges together with the opportunities to create a big impact with your skills. Lots of geolocational and temporal data in real-time combined with differences in the economics and dynamics of the cities we operate in make Wolt both a challenging and so interesting company to practice analytics.\nYou can choose the location from our tech hubs Helsinki, Berlin and Stockholm, or you can work entirely remotely anywhere in Finland, Germany, Sweden and Estonia. You have the chance to decide the ways of working — a hybrid, at the office, or remote within the location above. 💙 Read more about our remote setup.\nYou would get to work in a company culture where we take ownership beyond the obvious, do common things uncommonly well, we think big but stay humble, do right by people, we treat others kindly and justly, recognize that if we don’t learn, we won’t stay still but fall behind and keep in mind that Luke was Yoda’s greatest achievement. Read more about how we work.\n\nOur humble expectations\n\nDegree in Mathematics, Statistics, Computer Science, or a related field.\n5+ years of experience in a Data Analyst or Data Scientist position.\nExperience with the Payments domain - we’ll pay lots of attention to this experience.\nExpertise in statistical analysis, including hypothesis testing (A/B testing), and experimentation using statistical software packages in Python, R, or equivalent.\nProficiency in writing structured and efficient SQL queries for large data sets.\nHave prior experience building intuitive data visualizations and dashboards that influence business decisions, utilizing tools like Tableau, Mixpanel, Looker, or similar.\n\nNext Steps\n\nThe position will be filled as soon as we find the right person, so make sure to apply as soon as you realize you really, really want to join us!\n\nThe compensation will be a negotiable combination of monthly pay and DoorDash RSUs. The latter makes it exceptionally easy to be excited about our company growing and doing well, as you’ll own a piece of the pie.\n\nFor any further questions about the position, you can turn to Product+ Talent Acquisition Partner - Zhanna Filintseva (zhanna.filintseva@wolt.com)\n\nAbout Wolt\n\nWolt is a technology company that makes it incredibly easy to discover and get the best restaurants, grocery stores and other local shops delivered to your home or office. Wolt is not just a delivery app – we’re a technology company building a commerce platform to seamlessly connect our millions of customers with thousands of merchant and courier partners, in real-time across 23 countries and 250+ cities. Our apps (iOS and Android) have the industry’s highest ratings, largely thanks to our customer-first-mindset, which shows in how we build products and run operations. In June 2022 we officially joined forces with DoorDash. Combined, we have a presence in 27 countries, 23 of which operate with the Wolt brand and app. Wolt and DoorDash continue largely independently, with Wolt’s name, brand, product, technology and team.\n\nWorking in Product Development at Wolt\n\nAt Wolt, we’re about getting things done. You’ll probably enjoy it here if you like taking ownership, developing yourself and being around friendly, humble and ambitious people.\n\nThe behind the scenes of Wolt is run by an awesome bunch of over 400+ planners, builders, designers and data crunchers. We call ourselves Product+, as we’re the very core of Wolt’s products, tools and platforms. To build our products, we work in over 40 cross-functional, independent and autonomous teams. Teams are made up of a mix of talented individuals: engineers, designers, data scientists, analysts, and product leads. Each team takes ownership for solving customer problems in the best possible way.\n\nOur Commitment to Diversity, Equity & Inclusion\n\nWe want to have all sorts of people in our team – people like you and me, and people different from you and me. To be able to work with diverse teammates – when it comes to gender, age, ethnicity, life background, sexual orientation, political views, religion, or any other personal trait – we consciously aim to offer equal opportunity for everyone to work with us. This is because we believe diverse teams make the most thought-through decisions and build things in the most inclusive way.\n\nJoin us today to build Wolt together!\n\nSee less\nSeniority level\n\nMid-Senior level\nIndustry\n\nSoftware Development\nEmployment type\n\nFull-time\nJob functions\n\nAnalyst",
  "language": "english",
  "source": "",
  "company_name": "Wolt",
  "title": "Data Scientist",
  "post_date": "Unknown",
  "keywords": [
    "Consumer Analytics",
    "Data Insights",
    "Payments Domain",
    "Data Scientist",
    "Statistical Analysis",
    "Experimentation",
    "SQL Queries",
    "Data Visualization",
    "Tableau",
    "Python",
    "R",
    "DoorDash RSUs"
  ]
}