{
  "raw_text": "Senior Principal Applied Scientist\n\nLocation\n    Berlin\nContract\n    Full time\nJob Category\n    Applied Science & Research\n\n \n\nThe Discovery team assists customers in their fashion discovery journey and helps them find what they are looking for. We are developing the next generation of our discovery systems, utilizing state-of-the-art natural language processing (NLP) and/or information retrieval (IR) methods, particularly transformer-based deep neural networks and large language models (LLMs).\n\nAs a Senior Principal Applied Scientist, you will address challenging fashion problems using cutting-edge approaches. You will contribute to drive our scientific roadmap, applying your scientific capabilities and in collaboration with a team of exceptional scientists and engineers developing models and cutting-edge machine learning products that enhance the experience of over 51 million customers. \n\nWHERE YOUR EXPERTISE IS NEEDED\n\n    Utilize your extensive scientific experience in researching, deploying, and architecting machine learning and deep learning solutions in NLP and IR to enhance the inspiration journey of millions of our customers in large scale projects. Collaborate with multiple teams to create a cutting-edge science stack that aligns with the product strategy and drive architectural and design principles.\n\n    Develop long term roadmaps for research topics that span multiple product areas and address concrete business goals. As part of the leadership team, be the sparring partner and trusted advisor for Zalando senior leadership and advise on investments in people, strategic direction and make or buy decisions.\n\n    Act as a mentor and guide to senior and principal scientists, and actively share knowledge and expertise within Zalando’s science community. \n\n    Forge close partnerships with applied science leaders and product managers, to deliver state-of-the-art machine learning solutions to our customers and uncover new opportunities for growth.\n\nWHAT WE ARE LOOKING FOR\n\n    PhD in NLP, IR, machine learning, or related fields (or equivalent experience), accompanied by 8+ years of industry experience, especially deep learning based NLP and/or IR methods.\n\n    Experience leading and shaping the scientific roadmap of the teams in products that span across multiple areas and working with senior AS leaders. Ability to discover new business opportunities collaborating with product, science, and engineering managers and solve business problems through scientific solutions.\n\n    Extensive track record of addressing real-world problems using machine learning throughout the entire product cycle, and raises departments and Zalando’s best practice in methods, algorithms and technology, including architecture, design patterns, and research roadmaps.\n\n    Authority on deep learning and extensive track record to leveraging research to advance the state of the art, including strong publication records at top-tier venues such as ACL, NAACL, EMNLP, SIGIR, KDD, WWW, ICLR, NeurIPS, ICML, JMLR, etc.\n\n    Extensive hands-on experience in deep learning with proficiency in Python and frameworks like PyTorch or TensorFlow. Expertise with LLMs and their applications in IR. Proficiency in cloud computing platforms such as AWS is also required. \n\nINCLUSIVE BY DESIGN\n\nAt Zalando, our vision is to be inclusive by design. And this vision starts with our hiring - we do not discriminate on the basis of gender identity, sexual orientation, personal expression, ethnicity, religious belief, or disability status. You are welcome to leave out your picture, age, or marital status from your application. We only assess candidates on their qualifications and merit. ​\n\n    We want to provide you with a great candidate experience. Feel free to inform us of any accommodations you may need, so we can best support you throughout the hiring process. \n\n    do.BETTER - our diversity & inclusion strategy: https://corporate.zalando.com/en/our-impact/dobetter-our-diversity-and-inclusion-strategy\n    Our employee resource groups: https://corporate.zalando.com/en/our-impact/our-employee-resource-groups\n\n    Opportunity to work from abroad for 30 (working) days per calendar year\n\nFinancial\n\n    Access to the employee shares program\n\n    40% shopping discount on products shipped and sold by Zalando, and 30% discount on Zalando Lounge\n\n    Discounts from a wide range of external partners\n\n    SBB Half Fare Travelcard\n\nFamily\n\n    4 weeks paid paternity leave and 17 weeks paid maternity leave\n\n    3 fully-paid child sick days per year\n\n    Free counseling, assistance, and referral service for all matters concerning yourself and your family via the Fürstenberg Institute.\n     \n\nABOUT ZALANDO\n\nIt’s the perfect time to join Zalando on our journey, from being a pioneer in the world of e-commerce, to the starting point for fashion in Europe. We connect customers, brands, and partners across 23 markets.\n\nHelp us drive digital and sustainable solutions for fashion, logistics, advertising and research, bringing head-to-toe fashion to more than 48 million active customers through a team of diverse skill-sets, cultural backgrounds, and interests.\n\nOur values https //jobs.zalando.com/en/our-founding-mindset\n\ndo.More - our sustainability strategy https //corporate.zalando.com/en/sustainability\n\nFollow us on Instagram instagram.com/insidezalando\n\nPlease note that all applications must be completed using the online form - we do not accept applications via email.\n\nRecruiter\n\nShilpa Mishra\n\nshilpa.mishra@zalando.de\n\nBitte beachten, dass alle Bewerbungen auf dieser Seite über das Online-Formular erfolgen müssen – wir akzeptieren keine Bewerbungen per E-Mail. Nach der Prüfung werden unsere Recruiter*innen über eine offizielle Zalando E-Mail-Adresse (@zalando.de) Kontakt aufnehmen.\n\nIn einigen Fällen arbeiten wir auch mit einer Auswahl von Headhunter*innen und Agenturen zusammen, um bestimmte Positionen zu besetzen. Bitte beachte, dass weder Zalando noch unsere Rekrutierungspartner*innen irgendeine Art von Bezahlung verlangen, um sich für eine Stelle zu bewerben oder an einem Vorstellungsgespräch teilzunehmen. \n\nWenn du Fragen zu unserem Rekrutierungsprozess hast, wirf bitte einen Blick auf unsere FAQ-Seite.",
  "language": "english",
  "source": "",
  "company_name": "Zalando",
  "title": "Senior Principal Applied Scientist",
  "post_date": "Unknown",
  "keywords": [
    "Berlin",
    "Full time",
    "Applied Science & Research",
    "Natural Language Processing",
    "Information Retrieval",
    "Transformer-based deep neural networks",
    "Large language models",
    "PyTorch",
    "TensorFlow",
    "AWS"
  ]
}